[M_Ep7_ATrainToCatch MissionDefinition]
MissionDescription="I saved Roland from Hyperion. Because today you saved me from evil people. "Thanks. Now let's talk about putting a bullet in Jack's mouth." [Location] Temple Dialogue [-Location].]."

[M_Ep7_ATrainToCatch:DefeatBotBossSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend Mordecai tells him that the Hyperion train keys are being sent to the Tundra Express.. Roland suggests stealing a train.. Instead of searching for the key to unlock the safe He meets an evil Hyperion soldier named William.. must kill him."

[M_Ep7_ATrainToCatch:GetBackToSanctuarySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mordechai's friend Roland tells him that the key to the vault was delivered on the Tundra Express [-local] Hyperion train.. Roland offers train and flight travel. But instead of finding the box of keys, Hyperion finds a powerful soldier named William and kills him.. But there is a silver lining. It will have a firm foundation, will be protected by stones and will retain its power forever.."

[M_Ep7_ATrainToCatch:GetTinaExplosivesSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend Mordecai tells him that the security key will be sent to Hyperion's Tundra Express.. Roland offers to steal the train.. Roland also suggests meeting the bombshell named Tina.. What have you done?. Roland also warns Tina that she might be going crazy.. WHO?.'' Who knows how this could help train thieves?."

[M_Ep7_ATrainToCatch:GoToTundraExpressSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion plans to use the shield button to launch alien warriors and destroy everything in Pandora.. If he steals the key, Hyperion's plan will fail.. Roland investigates a man named Hyperion who lives on the Tundra Express.]. As you approach, you will see where the Turtle Key is.."

[M_Ep7_ATrainToCatch:GoToWreckageSiteSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Friend Roland Mortke will tell you that the key to the vault is transported to the Hyperion Train [source] on the Tundra Express [source].. You hijacked a train. You just need to find the part and find the key in the safe.."

[M_Ep7_ATrainToCatch:IncinerateVarkidSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion plans to use the shield button to launch alien warriors and destroy everything in Pandora.. If he steals the key, Hyperion's plan will fail.. Roland investigates a man named Hyperion who lives on the Tundra Express.]. As you approach, you will see where the Turtle Key is.. Unfortunately, Roland's contact is hungover. You'll have to set some varkids on fire so their screeches will wake him up."

[M_Ep7_ATrainToCatch:IncinerateVarkidsWeaponCheckSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion plans to use the shield button to launch alien warriors and destroy everything in Pandora.. If he steals the key, Hyperion's plan will fail.. Roland investigates a man named Hyperion who lives on the Tundra Express.]. As you approach, you will see where the Turtle Key is.. Unfortunately, Roland's contact is hungover. You'll have to set some varkids on fire so their screeches will wake him up."

[M_Ep7_ATrainToCatch:MeetTinyTinaSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion plans to use the Vault Key to awaken the alien soldiers and wipe out all of Pandora.. However, if the vault is successfully stolen, the Hyperion system will be destroyed.. Roland's spy, a former treasure hunter named Mordechai, tells him that the key was placed on the train [land] via the Tundra Express [-land]. But to break it, you need help. Roland suggests visiting Tina, the bomb maker and Roland's old friend."

[M_Ep7_ATrainToCatch:MeetTinyTinaTitleCardSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion plans to use the Vault Key to awaken the alien soldiers and wipe out all of Pandora.. However, if the vault is successfully stolen, the Hyperion system will be destroyed.. Roland's spy, a former treasure hunter named Mordechai, tells him that the key was placed on the train [land] via the Tundra Express [-land]. But to break it, you need help. Roland suggests visiting Tina, the bomb maker and Roland's old friend."

[M_Ep7_ATrainToCatch:PickupPowercoreSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend Mordechai tells him that the key to the vault is kept aboard the Hyperion [location] Tundra Express [location].. Roland tells you to capture and steal the ship before he finds the key to the safe, but you'll have to kill a Hyperion soldier named William.. However, there is a silver lining. He has a special energy pack that lasts forever if inserted into Hal's armor.. "

[M_Ep7_ATrainToCatch:ReturntoTinaSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend Mordecai says that the Tundra Express Hyperion train has been given the key to the [address] lock.. Ron said his train was stolen. Roland also suggests seeing a bomb expert named Tila.. what is happening. Roland also warns Tina not to be fooled.. As soon as possible. To steal the train, Tina asks her daughters to buy a "nutty donkey"..'' It is speculated that he may have some connection with the train robbery.. "

[M_Ep7_ATrainToCatch:TakeDollExplosivesSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend Mordecai tells you that the key to Hyperion's vault [location] on the Tundra Express [location] has been delivered.. Roland suggests a train robbery and a robbery.. Roland suggests meeting with an explosives expert named Tina.. what are you doing. Roland warns Tina that she might be crazy.. WHO organization. Building explosives is a good idea when building a guided rock by combining explosives collected in the game.. Tina gives this "girl" the power to destroy the train tracks and attack the Hyperion train.."
